In [1]:
import numpy as np
import pandas as pd

In [3]:
l=np.arange(6,12).reshape(2,3)

In [4]:
l

array([[ 6,  7,  8],
       [ 9, 10, 11]])

In [5]:
df=pd.DataFrame(l,columns=["var1","var2","var3"])

In [6]:
df

   var1  var2  var3
0     6     7     8
1     9    10    11

In [7]:
df.axes # index bilgilerini verir.

[RangeIndex(start=0, stop=2, step=1),
 Index(['var1', 'var2', 'var3'], dtype='object')]

In [8]:
df.shape

(2, 3)

In [9]:
df.ndim

2

In [10]:
df.size

6

In [16]:
df.iloc[0:1].mean()

var1    6.0
var2    7.0
var3    8.0
dtype: float64

In [19]:
df.sum()

var1    15
var2    17
var3    19
dtype: int64

In [21]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [22]:
dictionary={"var1":s1,"var2":s2,"var3":s3}

In [23]:
df=pd.DataFrame(dictionary)

In [24]:
df

   var1  var2  var3
0     8     7     0
1     8     1     6
2     7     8     2
3     7     4     6
4     1     3     0

In [26]:
df.index=["a","b","c","d","e"]

In [27]:
df

   var1  var2  var3
a     8     7     0
b     8     1     6
c     7     8     2
d     7     4     6
e     1     3     0

In [28]:
df.iloc[0,1]

7

In [30]:
df.iloc[3,1]

4

In [31]:
df.iloc[1:3,1]

b    1
c    8
Name: var2, dtype: int32

In [35]:
df.drop("a",axis=0) # drop silme methodudur. Fakat kalıcı olarak silmez.

   var1  var2  var3
b     8     1     6
c     7     8     2
d     7     4     6
e     1     3     0

In [ ]:
df.drop("a",axis=0,inplace=True) # dersek a kalıcı olarak silinir.

In [36]:
df.drop(["a","c"],axis=0) # bu da 1 den fazla elemanı siler. inplace=True demedik kalıcı silmedi. [] funcy methodu denir

   var1  var2  var3
b     8     1     6
d     7     4     6
e     1     3     0

In [37]:
df

   var1  var2  var3
a     8     7     0
b     8     1     6
c     7     8     2
d     7     4     6
e     1     3     0

In [38]:
"var1" in df

True

In [40]:
l=["var1","var2","var3","var4"] 
for i in l:
    print(i in df)

True
True
True
False

In [41]:
df.iloc[0,0:3] # ilk satırı verir.

var1    8
var2    7
var3    0
Name: a, dtype: int32

In [47]:
df["var4"]=df["var1"]+df["var2"]+df["var3"]

In [48]:
df

   var1  var2  var3  var4
a     8     7     0    15
b     8     1     6    15
c     7     8     2    17
d     7     4     6    17
e     1     3     0     4

In [52]:
df["var5"]=df["var1"]+df["var2"]+df["var3"]+df["var4"]

In [53]:
df

   var1  var2  var3  var4  var5
a     8     7     0    15    30
b     8     1     6    15    30
c     7     8     2    17    34
d     7     4     6    17    34
e     1     3     0     4     8

In [57]:
df

   var1  var2  var3  var4
a     8     7     0    15
b     8     1     6    15
c     7     8     2    17
d     7     4     6    17
e     1     3     0     4

In [58]:
df.drop("var4",axis=1,inplace=True)

In [59]:
df.drop("var3",axis=1)

   var1  var2
a     8     7
b     8     1
c     7     8
d     7     4
e     1     3

In [62]:
df.drop("var1",axis=1)

   var2  var3
a     7     0
b     1     6
c     8     2
d     4     6
e     3     0

In [64]:
df

   var1  var2  var3
a     8     7     0
b     8     1     6
c     7     8     2
d     7     4     6
e     1     3     0

In [66]:
df["var1"][1:4] # var1 değişkeninin içindeki elemanlarda seçilir.

b    8
c    7
d    7
Name: var1, dtype: int32

In [68]:
df[df.var1>7] # var1 içindeki değişkenler içinden 7 den büyük olanları gösterir.

   var1  var2  var3
a     8     7     0
b     8     1     6

In [69]:
df[(df.var1>7) & (df.var3>4)]

   var1  var2  var3
b     8     1     6

In [74]:
df[df.var1>5][["var1","var2"]] # böyle yazarakta sadece var1 ve var2 gelir.

   var1  var2
a     8     7
b     8     1
c     7     8
d     7     4

In [76]:
df[(df.var1>5) & (df.var2>2) & (df.var3>4)]

   var1  var2  var3
d     7     4     6

In [77]:
df2=df*4

In [78]:
df2

   var1  var2  var3
a    32    28     0
b    32     4    24
c    28    32     8
d    28    16    24
e     4    12     0

In [79]:
df3=pd.concat([df,df2], ignore_index=True)

In [80]:
df3

   var1  var2  var3
0     8     7     0
1     8     1     6
2     7     8     2
3     7     4     6
4     1     3     0
5    32    28     0
6    32     4    24
7    28    32     8
8    28    16    24
9     4    12     0

In [81]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [83]:
df3.columns=["deg1","deg2","deg3"]

In [84]:
df3

   deg1  deg2  deg3
0     8     7     0
1     8     1     6
2     7     8     2
3     7     4     6
4     1     3     0
5    32    28     0
6    32     4    24
7    28    32     8
8    28    16    24
9     4    12     0

In [86]:
df2.columns=["in1","in2","in3"]

In [87]:
df2

   in1  in2  in3
a   32   28    0
b   32    4   24
c   28   32    8
d   28   16   24
e    4   12    0

In [88]:
# concat ile tüm değişkenler birleştirilir.

In [89]:
df4=pd.concat([df,df2,df3],join="inner", ignore_index=True)

In [90]:
df4 # join kesişimleri birleştirir. 3 dataframede ortak eleman olmadığı için birleştirme index bazında kaldı.

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [98]:
df1=pd.DataFrame ({"calisanlar":["Ali","Veli","Ayse","Fatma"],"grup":["Mühendislik","Muhasebe","İk","Satis"]})

In [99]:
df2=pd.DataFrame ({"calisanlar":["Ali","Ayse","Veli","Fatma"],"ise_giris":[2019,2020,2018,2021]})

In [100]:
df1

  calisanlar         grup
0        Ali  Mühendislik
1       Veli     Muhasebe
2       Ayse           İk
3      Fatma        Satis

In [101]:
df2

  calisanlar  ise_giris
0        Ali       2019
1       Ayse       2020
2       Veli       2018
3      Fatma       2021

In [105]:
df3=pd.merge(df1,df2, on ="calisanlar") # 2 dataframede de calisanlar ortak olduğu için buna göre birleştirme yaptı.

In [106]:
df3

  calisanlar         grup  ise_giris
0        Ali  Mühendislik       2019
1       Veli     Muhasebe       2018
2       Ayse           İk       2020
3      Fatma        Satis       2021

In [107]:
df4= pd.DataFrame({"grup":["Muhasebe","Mühendislik","İk","Satis"],"mudur":["Caner","Ahmet","Mehmet","Osman"]})

In [108]:
df5=pd.merge(df3,df4)

In [109]:
df5

  calisanlar         grup  ise_giris   mudur
0        Ali  Mühendislik       2019   Ahmet
1       Veli     Muhasebe       2018   Caner
2       Ayse           İk       2020  Mehmet
3      Fatma        Satis       2021   Osman

In [113]:
df6= pd.merge(df2,df5)

In [114]:
df6

  calisanlar  ise_giris         grup   mudur
0        Ali       2019  Mühendislik   Ahmet
1       Ayse       2020           İk  Mehmet
2       Veli       2018     Muhasebe   Caner
3      Fatma       2021        Satis   Osman

In [115]:
# veri görseleştirme:

In [2]:
# ilk önce seaborn import edilir.
import seaborn as sns

In [3]:
# sns.load_dataset bize seaborn kütüphanesinde ki verileri getirir.
df=sns.load_dataset("titanic")

In [4]:
df.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df["fare"].mean()  # fare daki tüm değerlerin ortalamasını verir.

32.2042079685746

In [6]:
df.mean() # tüm verilerin ortalamalrını alır.

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [7]:
df.std() # tüm verilerin stantart sapma değerlerini alır.

survived       0.486592
pclass         0.836071
age           14.526497
sibsp          1.102743
parch          0.806057
fare          49.693429
adult_male     0.489615
alone          0.489615
dtype: float64

In [8]:
df.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [9]:
df["age"].count()

714

In [131]:
df["age"].min()

0.42

In [132]:
df["age"].max()

80.0

In [133]:
df["age"].sum()

21205.17

In [135]:
df.head(5).describe().T
# describe tüm istatiksel işlemlerini gösterir.

          count      mean        std    min     25%    50%   75%      max
survived    5.0   0.60000   0.547723   0.00   0.000   1.00   1.0   1.0000
pclass      5.0   2.20000   1.095445   1.00   1.000   3.00   3.0   3.0000
age         5.0  31.20000   6.833740  22.00  26.000  35.00  35.0  38.0000
sibsp       5.0   0.60000   0.547723   0.00   0.000   1.00   1.0   1.0000
parch       5.0   0.00000   0.000000   0.00   0.000   0.00   0.0   0.0000
fare        5.0  29.52166  30.510029   7.25   7.925   8.05  53.1  71.2833

In [140]:
df.head(3).groupby("age").mean()

      survived  pclass  sibsp  parch     fare  adult_male  alone
age
22.0         0       3      1      0   7.2500        True  False
26.0         1       3      0      0   7.9250       False   True
38.0         1       1      1      0  71.2833       False  False

In [8]:
df.head(7).groupby("age")["survived"].mean()
# yaşa göre hayatta kalma

age
22.0    0.0
26.0    1.0
35.0    0.5
38.0    1.0
54.0    0.0
Name: survived, dtype: float64

In [ ]:
# bir liste oluşturun ve bu liste de ki sayıların sırasıyla : 
# aritmetik ortalamasını, varyans değerlerini ve standart sapmalarını alın.

In [66]:
def numbers():
    liste=[]
    kac_kez=int(input("Toplam kaç elemanlı bir liste oluşturacaksın? "))
    for i in range(0,kac_kez):
        rakam=int(input(f"{i+1} sıralı rakamı giriniz : "))
        liste.append(rakam)
    df= pd.DataFrame(liste)
    a=df.mean()
    b=df.std()
    c=df.var()
    d=df.median()
    df1=pd.DataFrame({"aritmetik ort.": a , "standart sapma" : b,
                     "varyans" : c , "median" : d})
    print(df1)

In [67]:
numbers()

Toplam kaç elemanlı bir liste oluşturacaksın? 3
1 sıralı rakamı giriniz : 45
2 sıralı rakamı giriniz : 6
3 sıralı rakamı giriniz : 40
   aritmetik ort.  standart sapma     varyans  median
0       30.333333       21.221059  450.333333    40.0

In [20]:
df= pd.DataFrame({"groups":["A","B","C"],"deg1":[12,5,8],"deg2":[11,4,7]})

In [21]:
df

  groups  deg1  deg2
0      A    12    11
1      B     5     4
2      C     8     7

In [22]:
import seaborn as sns

In [23]:
df=sns.load_dataset("titanic")

In [25]:
df.head(6)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
df=pd.DataFrame({"survived":[0,1,1,2,0,0],"pclass":[3,1,3,1,3,3],"cinsiyet":["male","female","female","female","male","male"],
                "age":[22,38,26,35,35,42],"who":["man","woman","woman","woman","man","man"],
                 "class":["Third","First","Third","First","Third","Third"]},
                columns=["survived","pclass","cinsiyet","age","who","class"])

In [27]:
df

   survived  pclass cinsiyet  age    who  class
0         0       3     male   22    man  Third
1         1       1   female   38  woman  First
2         1       3   female   26  woman  Third
3         2       1   female   35  woman  First
4         0       3     male   35    man  Third
5         0       3     male   42    man  Third

In [58]:
def filter_age(x):
    return x["age"].std()>9

In [59]:
df.groupby("who").filter(filter_age)

   survived  pclass cinsiyet  age  who  class
0         0       3     male   22  man  Third
4         0       3     male   35  man  Third
5         0       3     male   42  man  Third

In [60]:
df

   survived  pclass cinsiyet  age    who  class
0         0       3     male   22    man  Third
1         1       1   female   38  woman  First
2         1       3   female   26  woman  Third
3         2       1   female   35  woman  First
4         0       3     male   35    man  Third
5         0       3     male   42    man  Third

In [61]:
# Pivot Sorgulama:

In [63]:
df.groupby("who")[["survived"]].mean()
# erkeklerde ve kadınlarda hayatta kalma oranı.

       survived
who
man    0.000000
woman  1.333333

In [70]:
df.groupby(["who","age","class"])[["survived"]].mean()

                 survived
who   age class
man   22  Third         0
      35  Third         0
      42  Third         0
woman 26  Third         1
      35  First         2
      38  First         1

In [71]:
# pivot tablo ile gösterme:

In [74]:
df.pivot_table("survived",["cinsiyet","who","age","class"])

                          survived
cinsiyet who   age class
female   woman 26  Third         1
               35  First         2
               38  First         1
male     man   22  Third         0
               35  Third         0
               42  Third         0